Tekla Open API Reference for Tekla Structures 2025
IntegerConverter Class
 The IntegerConverter class converts types to and from the integer datatype.
Inheritance Hierarchy
System.Object
 System.ComponentModel.TypeConverter
 Tekla.Structures.Datatype.IntegerConverter
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class IntegerConverter : TypeConverter
Public Class IntegerConverter
	Inherits TypeConverter
The IntegerConverter type exposes the following members.
Constructors
Name | Description
IntegerConverter
Initializes a new instance of the IntegerConverter class
Top
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the integer datatype.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the integer datatype to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the Tekla.Structures.Datatype.Integer type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the the integer datatype to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
Tekla.Structures.Datatype Namespace